app/views/canvas_fields/show.haml

          .row
            - @canvasfield.postits.each do |p|
              .col-md-4
                .panel.panel-warning
                  .panel-heading
---
SELECT "postits".* FROM "postits" WHERE "postits"."canvas_field_id" = 56

      .panel-body
        = render @canvasfield.comments.limit(3)
---
SELECT "comments".* FROM "comments" WHERE "comments"."canvas_field_id" = 64