app/controllers/businessmodels_controller.rb

  def new
    @businessmodel = Businessmodel.create
    @businessmodel.save
    @businessmodel.canvas_fields.create(:title => "Key Partners")
---
INSERT INTO "businessmodels" ("created_at", "hashtag", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 08 Mar 2014 15:59:09 UTC +00:00], ["hashtag", nil], ["updated_at", Sat, 08 Mar 2014 15:59:09 UTC +00:00]]
INSERT INTO "canvas_fields" ("businessmodel_id", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["businessmodel_id", 2], ["created_at", Sat, 08 Mar 2014 16:41:36 UTC +00:00], ["title", "Value Propositions"], ["updated_at", Sat, 08 Mar 2014 16:41:36 UTC +00:00]]

  def show
    @businessmodel = Businessmodel.find(params[:id])
    @keypartners       = @businessmodel.canvas_fields.find_by_title("Key Partners")
---
SELECT "businessmodels".* FROM "businessmodels" WHERE "businessmodels"."id" = ? LIMIT 1  [["id", :id]]
SELECT "canvas_fields".* FROM "canvas_fields" WHERE "canvas_fields"."businessmodel_id" = 2 AND "canvas_fields"."title" = 'Value Proposition' LIMIT 1