app/controllers/canvas_fields_controller.rb

    def load_field
      @canvasfield = CanvasField.find(params[:id])
---
SELECT "canvas_fields".* FROM "canvas_fields" WHERE "canvas_fields"."id" = ? LIMIT 1  [["id", "56"]]