app/controllers/comments_controller.rb

INSERT INTO "comments" ("comment", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "21212"], ["commentable_id", nil], ["commentable_type", nil], ["created_at", Sun, 09 Mar 2014 10:28:49 UTC +00:00], ["updated_at", Sun, 09 Mar 2014 10:28:49 UTC +00:00]]
---
  def create
    if current_model?
      @comment = Comment.new(params[:comment])
      @comment.save