app/controllers/postits_controller.rb

  def new
    session[:return_to] = request.referer
    @postit = Postit.new
    @canvasfield = CanvasField.find(params[:field])
---
SELECT "canvas_fields".* FROM "canvas_fields" WHERE "canvas_fields"."id" = ? LIMIT 1  [["id", "48"]]

  def create
    if current_model?
      @postit = Postit.new(params[:postit])
      @postit.save
---
INSERT INTO "postits" ("canvas_field_id", "content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["canvas_field_id", 44], ["content", ""], ["created_at", Sun, 09 Mar 2014 09:12:20 UTC +00:00], ["title", "1212"], ["updated_at", Sun, 09 Mar 2014 09:12:20 UTC +00:00]]

  def edit
    session[:return_to] = request.referer
    @postit = Postit.find(params[:id])
---
SELECT "postits".* FROM "postits" WHERE "postits"."id" = ? LIMIT 1  [["id", "6"]]

  def update
    if @postit.update_attributes(params[:postit])
---
UPDATE "postits" SET "content" = '21212', "updated_at" = '2014-03-09 09:42:53.336630' WHERE "postits"."id" = 15

    def load_postit
      @postit = Postit.find(params[:id])
---
SELECT "postits".* FROM "postits" WHERE "postits"."id" = ? LIMIT 1  [["id", "15"]]